# Задача 1. Датчик дождя

sensor_rain = int(input('На улице идёт дождь?: '))
if sensor_rain == 1:
    print('Пошёл дождь. Возьмите зонтик')