# Задача 7. Защита от дурака

number = int(input('Введите двузначное число'))

if 9 < number < 100:
    print("Число двузначное")
else:
    print('Число не двузначное')

# Сидел ломал голову как проверить с помощью делений с остатком или ещё чего, не смог, поэтому написал так.
