# Задача 14. Кинотеатр (необязательно)

boys = int(input('Введите кол-во мальчиков: '))
girls = int(input('Введите кол-во девочек: '))
girl = 'G'
boy = 'B'
decision = ''

if boys < girls and girls % boys == 0 and girls / boys == 2:
    for _ in range(1, girls):
        decision +=

print(decision)




