# Задача 4. Пингвины
n = int(input('Сколько раз показать пингвина?: '))

for penguin in range(1, n + 1):
    print('   _~_    ')
    print('  (o o)   ')
    print(' /  V  \  ')
    print('/(  _  )\ ')
    print('  ^^ ^^   ')